<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html><!-- GenHTML@16097-->
<head>
<META HTTP-EQUIV="Content-type" CONTENT="text/html; charset=iso-8859-1">
<title>Your First Cup: An Introduction to the Java EE Platform</title>
<link rel="stylesheet" type="text/css" href="css/default.css">
<!--stopindex-->
</head>

<body leftmargin="0" topmargin="0" marginheight="0" marginwidth="0" bgcolor="#ffffff"  class="a0v0">
<a name="top"></a>

<!-- BEGIN A1 COMPONENT V.0 -->
<div class="a1">
<div class="a1v0">
<table cellpadding="0" cellspacing="0" border="0" width="100%">
<tr valign="bottom">
<td nowrap="nowrap">
<span class="toolbarlinks">
<a href="http://www.sun.com">sun.com</a>
<a href="http://docs.sun.com/" class="dividelink">docs.sun.com</a>
</span>
</td><td align="right" nowrap="nowrap">
<span class="toolbarlinks">
<a href="http://www.sun.com/MySun/">My Sun</a>
<a href="http://www.sun.com/worldwide/" class="dividelink">Worldwide Sites</a>
</span>
</td></tr>
</table>
</div>
</div>
<!-- END A1 COMPONENT V.0 -->

<!-- BEGIN A2 COMPONENT V.0 -->
<div class="a2" id="a2v0">
<div class="cornerTL">
<div class="cornerTR">
<div class="cornerBL">
<div class="cornerBR">
<div class="a2topiclinks">
<table cellpadding="1" cellspacing="0" border="0">
<tr valign="bottom">
<td><a href="http://www.sun.com/" title="Home Page"><img src="css/a.gif" alt="Home Page" width="104" height="58" border="0" class="sunlogo"></a></td><td><img src="css/a.gif" alt="" width="1" height="1" border="0" id="ip1"></td>
<td class="navlinks" id="navlink1">
<div>
<a id="glink1" href="http://www.sun.com/products/">Products</a>
</div>
</td><td><img src="css/a.gif" alt="" width="1" height="1" border="0" id="ip2"></td>
<td class="navlinks" id="navlink2">
<div>
<a id="glink2" href="http://www.sun.com/downloads/">Downloads</a>
</div>
</td><td><img src="css/a.gif" alt="" width="1" height="1" border="0" id="ip3"></td><td class="navlinks" id="navlink3">
<div>
<a id="glink3" href="http://www.sun.com/service/">Service &amp; Solutions</a>
</div>
</td><td><img src="css/a.gif" alt="" width="1" height="1" border="0" id="ip4"></td><td class="navlinks" id="navlink4">
<div>
<a id="glink4" href="http://www.sun.com/support/">Support</a>
</div>
</td><td><img src="css/a.gif" alt="" width="1" height="1" border="0" id="ip5"></td><td class="navlinks" id="navlink5">
<div>
<a id="glink5" href="http://www.sun.com/training/">Training</a>
</div>
</td><td><img src="css/a.gif" alt="" width="1" height="1" border="0" id="ip6"></td><td class="navlinks" id="navlink6">
<div>
<a id="glink6" href="http://research.sun.com/">Research</a>
</div>
</td>
</tr>
</table>
</div>

</div></div></div></div>
</div>
<!-- END A2 COMPONENT V.0 -->

<!-- BEGIN BREADCRUMB -->
<div id="breadcrumb">
&nbsp;
</div><br />
<!-- END BREADCRUMB -->

<!-- BEGIN WRAPPER TABLE, 1 COLUMN, MAIN -->
<table border="0" cellpadding="0" cellspacing="10" width="100%">
<tr><td width="100%" valign="top">
<!-- BEGIN CENTRAL COLUMN COMPONENTS -->

<!-- BEGIN PAGE CONTROL ROW -->
<table border="0" cellpadding="0" cellspacing="0" width="100%">
<tr class="grey1"><td></td><td align="right">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<A HREF="toc.html">Contents</A>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</td></tr>
</table>
<!-- END PAGE CONTROL ROW -->

</td></tr>
<tr><td width="100%" valign="top">
<a name="skip2content"> </a>

<!--startindex-->
<div class="maincontent">
<p>Part No: 819-6451</p><p>October 4, 2006</p>Sun Microsystems, Inc. <p><br>4150 Network Circle<br>Santa Clara, CA  95054 <br>U.S.A.</p><p>Copyright 2006, Sun Microsystems, Inc.</p><p>Sun Microsystems, Inc. has intellectual property rights relating to technology embodied in the product that is described in this document. In particular, and without limitation, these intellectual
property rights may include one or more U.S. patents or pending patent applications in the U.S. and in other countries.</pr><p>U.S. Government Rights - Commercial software.  Government users are subject to the Sun Microsystems, Inc. standard license agreement and applicable provisions of the FAR and its supplements.</pr><p>This distribution may include materials developed by third parties.</pr><p>Parts of the product may be derived from Berkeley BSD systems, licensed from the University of California. UNIX is a registered trademark in the U.S. and other countries, exclusively
licensed through X/Open Company, Ltd.</pr><p>Sun, Sun Microsystems, the Sun logo,
the Solaris logo, the Java Coffee Cup logo, docs.sun.com, 
Java, and
Solaris are trademarks or registered trademarks of Sun Microsystems, Inc. in the U.S.
and other countries. All SPARC trademarks are used under license and are trademarks
or registered trademarks of SPARC International, Inc. in the U.S. and other countries.
Products bearing SPARC trademarks are based upon an architecture developed by Sun
Microsystems, Inc. </pr><p>The OPEN LOOK and Sun&#153; Graphical User Interface was developed by Sun Microsystems, Inc. for
its users and licensees. Sun acknowledges the pioneering efforts of Xerox in researching
and developing the concept of visual or graphical user interfaces for the computer
industry. Sun holds a non-exclusive license from Xerox to the Xerox Graphical User
Interface, which license also covers Sun's licensees who implement OPEN LOOK GUIs
and otherwise comply with Sun's written license agreements.</pr><p>Products covered by and information contained in this publication are controlled by U.S. Export Control
laws and may be subject to the export or import laws in other countries. Nuclear,
missile, chemical or biological weapons or nuclear maritime end uses or end users,
whether direct or indirect, are strictly prohibited. Export or reexport to countries
subject to U.S. embargo or to entities identified on U.S. export exclusion lists,
including, but not limited to, the denied persons and specially designated nationals
lists is strictly prohibited.</pr><p>DOCUMENTATION IS PROVIDED "AS IS" AND ALL EXPRESS OR IMPLIED CONDITIONS, REPRESENTATIONS AND WARRANTIES, INCLUDING ANY
IMPLIED WARRANTY OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE OR NON-INFRINGEMENT,
ARE DISCLAIMED, EXCEPT TO THE EXTENT THAT SUCH DISCLAIMERS ARE HELD TO BE LEGALLY INVALID.</pr><hr><p></pr><p>Sun Microsystems, Inc. d&eacute;tient les droits de propri&eacute;t&eacute;
intellectuelle relatifs &agrave; la technologie incorpor&eacute;e dans
le produit qui est
d&eacute;crit dans ce document. En particulier, et ce sans limitation,
ces droits de
propri&eacute;t&eacute; intellectuelle peuvent inclure un ou plusieurs
brevets am&eacute;ricains ou des
applications de brevet en attente aux Etats-Unis et dans d'autres
pays.</pr><p>Cette distribution peut comprendre des composants
d&eacute;velopp&eacute;s par des tierces personnes.</pr><p>Certaines composants de ce produit peuvent &ecirc;tre
d&eacute;riv&eacute;es du logiciel Berkeley BSD, licenci&eacute;s par
l'Universit&eacute; de
Californie. UNIX est une marque d&eacute;pos&eacute;e aux Etats-Unis et
dans d'autres pays; elle est
licenci&eacute;e exclusivement par X/Open Company, Ltd. </pr><p>Sun, Sun Microsystems, le logo Sun, le logo Solaris, le logo Java
Coffee Cup, docs.sun.com, 
 Java et Solaris sont des
marques de fabrique ou des marques d&eacute;pos&eacute;es
de Sun Microsystems, Inc. aux Etats-Unis et dans d'autres pays. Toutes
les marques
SPARC sont utilis&eacute;es sous licence et sont des marques de fabrique
ou des
marques d&eacute;pos&eacute;es de SPARC International, Inc. aux
Etats-Unis et dans
d'autres pays. Les produits portant les marques SPARC sont bas&eacute;s
sur une
architecture d&eacute;velopp&eacute;e par Sun Microsystems, Inc.</pr><p>L'interface d'utilisation graphique OPEN LOOK et
Sun a &eacute;t&eacute;
d&eacute;velopp&eacute;e par Sun Microsystems, Inc. pour ses
utilisateurs et
licenci&eacute;s. Sun reconna&icirc;t les efforts de pionniers de Xerox
pour la
recherche et le d&eacute;veloppement du concept des interfaces
d'utilisation
visuelle ou graphique pour l'industrie de l'informatique. Sun
d&eacute;tient une licence non exclusive de Xerox sur
l'interface d'utilisation graphique Xerox, cette licence couvrant
&eacute;galement les
licenci&eacute;s de Sun qui mettent en place l'interface d'utilisation
graphique OPEN LOOK et
qui, en outre, se conforment aux licences &eacute;crites de Sun.</pr><p>Les produits qui font l'objet de cette publication et les
informations qu'il contient sont r&eacute;gis par la legislation
am&eacute;ricaine en mati&egrave;re de contr&ocirc;le des exportations et peuvent &ecirc;tre soumis au droit
d'autres pays dans le domaine des exportations et importations. Les utilisations finales, ou
utilisateurs finaux, pour des armes nucl&eacute;aires, des missiles, des armes
chimiques ou biologiques ou pour le nucl&eacute;aire maritime, directement ou
indirectement, sont strictement interdites. Les exportations ou r&eacute;exportations vers
des pays sous embargo des Etats-Unis, ou vers des entit&eacute;s figurant sur les
listes d'exclusion d'exportation am&eacute;ricaines, y compris, mais de mani&egrave;re non
exclusive, la liste de personnes qui font objet d'un ordre de ne pas participer, d'une fa&ccedil;on
directe ou
indirecte, aux exportations des produits ou des services qui sont
r&eacute;gis par la
legislation am&eacute;ricaine en mati&egrave;re de contr&ocirc;le des
exportations et la
liste de ressortissants sp&eacute;cifiquement design&eacute;s, sont
rigoureusement interdites.</pr><p>LA DOCUMENTATION EST FOURNIE "EN L'ETAT" ET TOUTES AUTRES CONDITIONS,
DECLARATIONS ET GARANTIES EXPRESSES OU TACITES SONT FORMELLEMENT EXCLUES,
DANS LA MESURE AUTORISEE PAR LA LOI APPLICABLE, Y COMPRIS NOTAMMENT
TOUTE GARANTIE IMPLICITE RELATIVE A LA QUALITE MARCHANDE, A L'APTITUDE A UNE
UTILISATION PARTICULIERE OU A L'ABSENCE DE CONTREFACON. </pr>
</div>
<!--stopindex-->

<!-- END CENTRAL COLUMN COMPONENTS -->
</td></tr>

<!-- BEGIN SPACER ROW -->
<tr><td><img src="css/a.gif" width="780" height="1" border="0" alt="" /></td></tr>
<!-- END SPACER ROW -->

<tr><td>

<!-- BEGIN PAGE CONTROL ROW -->
<table border="0" cellpadding="0" cellspacing="0" width="100%">
<tr class="suntab"><td></td><td align="right">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<A HREF="toc.html">Contents</A>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</td></tr>
</table>
<!-- END PAGE CONTROL ROW -->
</td></tr>

</table>
<!-- END WRAPPER TABLE, 1 COLUMN, MAIN -->


<!-- BEGIN A5 COMPONENT V.0 -->
<div class="a5" id="a5v0">
<span class="footerlinks">
<a href="http://www.sun.com/company/">Company Info</a>
<a href="http://www.sun.com/contact/">Contact</a>
<a href="http://www.sun.com/share/text/termsofuse.html">Terms of Use</a>
<a href="http://www.sun.com/privacy/">Privacy</a>

<span class="footercopy">Copyright 1994-2006 Sun Microsystems, Inc.</span>
</span>
</div>
<!-- END A5 COMPONENT V.0 -->

</body>
</html>

